trade_exp/src/DataProcessors/ПроверкаАдресногоХранения/ПроверкаАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаАдресногоХранения</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходнаяЯчейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦелеваяЯчейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Проверено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияПриПроверкеАдресногоХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>НетЭтикетки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СобытияПроверкиАдресногоХранения/СобытияПроверкиАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="47350683-0725-47ec-8136-558053b1c878">
  <name>СобытияПроверкиАдресногоХранения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="2df28ecf-5257-4671-bb7a-ad7cc2f5f6eb">
    <name>Проверено</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bff81d12-91a3-43b6-9f11-8960e3e4dc0f">
    <name>Действие</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f2ae8157-b79e-4025-bee0-3f6832ecdf2c">
    <name>НетЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="d1537522-9531-4f12-88c8-155135baf886">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="4fdf94da-beed-4ead-9e06-f33557f7cd70">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="96a38692-bf35-44f1-a587-459d871a122b">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="86bbe8d9-5cd5-490b-bfe3-722a19f1681b">
    <name>ИсходнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6377fbf1-2b56-4c9c-a808-efcb01fc0469">
    <name>ЦелеваяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/ДействияПриПроверкеАдресногоХранения/ДействияПриПроверкеАдресногоХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cc11fa7c-d2a9-4c13-9d56-a6f77444d68b">
  <name>ДействияПриПроверкеАдресногоХранения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6e205829-0d0c-48c7-9bed-49712f48d941">
    <name>ПереложитьВДругуюЯчейку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="75107e97-c012-4e72-8310-683457edd446">
    <name>ПрисвоитьТекущуюЯчейку</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af13aadd-1ff3-4ca9-ad06-5b916348a725">
    <name>СделатьЯчейкуДополнительной</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="066e30f6-7b05-4707-b88c-048e47e0ee62">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f3e5dfce-ce94-489f-bbc6-ba1b699e6a56">
    <name>ИспользованиеПериодичностиИнвентаризацииЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7afe322-1954-42ee-b9f7-20803df9f4db">
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="942b70ab-8729-495e-aa2e-e362fab7ecfd">
    <name>ТипСкладскойЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c08d78e7-8199-4896-a9fc-9ac0cb946bff">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60091b4d-b59a-402b-8b0a-8f53fca6515a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56a97705-349f-4913-8e45-02a642ba3195">
    <name>ПорядокОбхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc923ed7-93a9-4ab2-80bf-95d378dac70c">
    <name>Позиция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82b6a5ac-4bdb-4046-b405-1382915a4c74">
    <name>УровеньДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4a34412-3576-4048-b17b-40befc421c3f">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61217d52-e955-4b33-bc99-11d43aa1c1d9">
    <name>ОбластьХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63793c84-fe0a-46a7-b089-23086db66ef4">
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45830319-bd9f-49d6-afc3-425511de0559">
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПроверкаАдресногоХранения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&НаСервере
Функция ПолучитьСписокРабочихУчастковСотрудника(Сотрудник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
					|	РабочиеУчасткиСотрудника.РабочийУчасток
					|ИЗ
					|	Справочник.Сотрудники.РабочиеУчастки КАК РабочиеУчасткиСотрудника
					|ГДЕ
					|	РабочиеУчасткиСотрудника.Ссылка = &Сотрудник
					|	И РабочиеУчасткиСотрудника.РабочийУчасток.ПометкаУдаления = Ложь";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДоступныеРабочиеУчастки = Новый Массив();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеРабочиеУчастки.Добавить(Выборка.РабочийУчасток);	
	КонецЦикла;
	
	Возврат ДоступныеРабочиеУчастки;
	
КонецФункции

&НаСервере
Функция ДоступнаЯчейкаСотруднику(Сотрудник, Ячейка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ Ячейки.Ссылка
		|ИЗ 
		|	Справочник.Сотрудники.РабочиеУчастки КАК РабочиеУчасткиСотрудника
		|	СОЕДИНЕНИЕ 
		|		Справочник.СкладскиеЯчейки КАК Ячейки
		|	ПО РабочиеУчасткиСотрудника.РабочийУчасток = Ячейки.РабочийУчасток
		|ГДЕ 
		|	РабочиеУчасткиСотрудника.Ссылка = &Сотрудник
		|	И Ячейки.Ссылка = &Ячейка";	
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат Ложь
	Иначе
		Возврат Истина
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуруИзЯчейки(Склад, Ячейка, ДатаОстатков) Экспорт
	Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	РазмещениеПоЯчейкам.Номенклатура КАК Номенклатура,
		|	РазмещениеПоЯчейкам.Склад КАК Склад
		|ПОМЕСТИТЬ
		|	втНоменклатураВЯчейках
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеПоЯчейкам
		|ГДЕ
		|	РазмещениеПоЯчейкам.Склад = &Склад
		|	И РазмещениеПоЯчейкам.Ячейка = &Ячейка
		|	И РазмещениеПоЯчейкам.ОсновнаяЯчейка = ИСТИНА
		|;
		|
		|ВЫБРАТЬ
		|	втНоменклатураВЯчейках.Номенклатура КАК Номенклатура
		|	ИЗ
		|	втНоменклатураВЯчейках
		|	СОЕДИНЕНИЕ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОстатков, Склад = &Склад И Номенклатура В
		|			(ВЫБРАТЬ Номенклатура ИЗ втНоменклатураВЯчейках)) КАК ОстаткиНоменклатуры
		|		ПО
		|			втНоменклатураВЯчейках.Номенклатура = ОстаткиНоменклатуры.Номенклатура
		|			И втНоменклатураВЯчейках.Склад = ОстаткиНоменклатуры.Склад
		|СГРУППИРОВАТЬ ПО
		|	втНоменклатураВЯчейках.Номенклатура
		|ИМЕЮЩИЕ СУММА(ОстаткиНоменклатуры.ВНаличииОстаток) > 0	
		|УПОРЯДОЧИТЬ ПО втНоменклатураВЯчейках.Номенклатура.Наименование";		
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	
	СписокНоменклатуры = Запрос.Выполнить().Выгрузить();	
	
	Возврат СписокНоменклатуры;
	
КонецФункции

Функция ПолучитьЯчейкуНоменклатуры(Склад, Номенклатура, ОсновнаяЯчейка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ Ячейка
		|ИЗ 
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам
		|ГДЕ Склад = &Склад
		|И Номенклатура = &Номенклатура
		|И ОсновнаяЯчейка = &ОсновнаяЯчейка";	
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ОсновнаяЯчейка", ОсновнаяЯчейка);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ячейка
	Иначе
		Возврат Справочники.СкладскиеЯчейки.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьНоменклатуруПоШтрихкоду(Штрихкод, Склад, Ячейка, ЕстьОсновнаяЯчейка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ 
		|	Штрихкоды.Номенклатура, 
		|	ЕстьNULL(Ячейки.ОсновнаяЯчейка, Ложь) ЕстьОсновнаяЯчейка
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК Штрихкоды
		|ЛЕВОЕ СОЕДИНЕНИЕ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам Ячейки
		|	ПО Штрихкоды.Номенклатура = Ячейки.Номенклатура
		|	И Ячейки.ОсновнаяЯчейка = Истина
		|	И Ячейки.Склад = &Склад
		|	И Ячейки.Ячейка = &Ячейка
		|ГДЕ Штрихкоды.Штрихкод = &Штрихкод";	
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	Результат = Справочники.Номенклатура.ПустаяСсылка();
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЕстьОсновнаяЯчейка = Ложь;
	Если Выборка.Количество() > 0 Тогда
		Если Выборка.Следующий() Тогда
			Результат = Выборка.Номенклатура;
			ЕстьОсновнаяЯчейка = Выборка.ЕстьОсновнаяЯчейка; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ЕстьОсновнаяЯчейкаУНоменклатуры(Номенклатура, Склад, Ячейка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ 
		|	ЕстьNULL(ОсновнаяЯчейка, Ложь) ЕстьОсновнаяЯчейка
		|ИЗ
		|	РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам 
		|ГДЕ Номенклатура = &Номенклатура
		|	И ОсновнаяЯчейка = Истина
		|	И Склад = &Склад
		|	И Ячейка = &Ячейка";	
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Ложь;
	Если Выборка.Количество() > 0 Тогда
		Если Выборка.Следующий() Тогда
			Результат = Выборка.ЕстьОсновнаяЯчейка; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Функция ПроверитьРазмещениеНоменклатурыВЯчейках(ТаблицаТовары)Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки,
		|	ТаблицаТовары.Номенклатура,
		|	ТаблицаТовары.ИсходнаяЯчейка,				
		|	ТаблицаТовары.ЦелеваяЯчейка	
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
		|;
		|
		|ВЫБРАТЬ 
		|	Товары.НомерСтроки,
		|	Товары.Номенклатура,
		|	Товары.ИсходнаяЯчейка,
		|	Товары.ЦелеваяЯчейка,
		|	НомеклатураВЯчейках.Ячейка КАК ТекущаяЯчейка
		|ИЗ
		|	Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК НомеклатураВЯчейках
		|	ПО
		|		Товары.Номенклатура = НомеклатураВЯчейках.Номенклатура 
		|		И Товары.ИсходнаяЯчейка = НомеклатураВЯчейках.Ячейка
		|		И НомеклатураВЯчейках.ОсновнаяЯчейка = ИСТИНА
		|ГДЕ Товары.ИсходнаяЯчейка <> ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяССылка)
		|	И НомеклатураВЯчейках.Номенклатура ЕСТЬ NULL 	
		|	
		|ОБЪЕДИНИТЬ ВСЕ	
		|
		|ВЫБРАТЬ 
		|	Товары.НомерСтроки,
		|	Товары.Номенклатура,
		|	Товары.ИсходнаяЯчейка,
		|	Товары.ЦелеваяЯчейка,
		|	НомеклатураВЯчейках.Ячейка КАК ТекущаяЯчейка
		|ИЗ
		|	Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|		РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК НомеклатураВЯчейках
		|	ПО
		|		Товары.Номенклатура = НомеклатураВЯчейках.Номенклатура 
		|		И Товары.ЦелеваяЯчейка = НомеклатураВЯчейках.Ячейка
		|		И НомеклатураВЯчейках.ОсновнаяЯчейка = ИСТИНА
		|ГДЕ Товары.ИсходнаяЯчейка = ЗНАЧЕНИЕ(Справочник.СкладскиеЯчейки.ПустаяССылка)
		|	И НомеклатураВЯчейках.Номенклатура ЕСТЬ NOT NULL 		
		|	
		|УПОРЯДОЧИТЬ ПО 1";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаТовары);
	СписокНоменклатуры = Запрос.Выполнить().Выгрузить();	
	
	Возврат СписокНоменклатуры;
КонецФункции

&НаСервере
Функция ЗаписатьРезультатыПроверкиАХ(ТекстСообщения, ПолеСообщения)Экспорт
	Результат = Ложь;	
	ТекстСообщения = "";
	ПолеСообщения = "";
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		ТекстСообщения = "Не выбран склад";
		Возврат Результат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ячейка) Тогда
		ТекстСообщения = "Не выбрана ячейка";
		Возврат Результат;
	КонецЕсли;	
	
	Если Товары.Количество() = 0 Тогда
		ТекстСообщения = "Отсутствуют товары";
		Возврат Результат;
	КонецЕсли;
	
	
	Для Каждого Строка Из Товары Цикл
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда 
    		ТекстСообщения = "Отсутствует номенклатура в строке " + Строка(Строка.НомерСтроки);
    		ПолеСообщения = "Объект.Товары["+(Строка.НомерСтроки - 1)+"].Номенклатура";
			Возврат Результат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Строка.ЦелеваяЯчейка) Тогда 
    		ТекстСообщения = "Отсутствует фактическая ячейка в строке " + Строка(Строка.НомерСтроки);
    		ПолеСообщения = "Объект.Товары["+(Строка.НомерСтроки - 1)+"].ЦелеваяЯчейка";
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;
	
	
	ТаблицаЗначенийТовары = Товары.Выгрузить();
	СписокОшибочныхСтрок = ПроверитьРазмещениеНоменклатурыВЯчейках(ТаблицаЗначенийТовары);

	Если СписокОшибочныхСтрок.Количество() > 0 Тогда
		Если Не ЗначениеЗаполнено(СписокОшибочныхСтрок[0].ТекущаяЯчейка) Тогда
    		ТекстСообщения = "Номенклатура """ + СписокОшибочныхСтрок[0].Номенклатура + """ не находится в ячейке " + СписокОшибочныхСтрок[0].ИсходнаяЯчейка;
    		ПолеСообщения = "Объект.Товары["+(СписокОшибочныхСтрок[0].НомерСтроки - 1)+"].Номенклатура";
		Иначе
    		ТекстСообщения = "Номенклатура """ + СписокОшибочныхСтрок[0].Номенклатура + """ уже находится в ячейке " + СписокОшибочныхСтрок[0].ИсходнаяЯчейка;
    		ПолеСообщения = "Объект.Товары["+(СписокОшибочныхСтрок[0].НомерСтроки - 1)+"].Номенклатура";
		КонецЕсли;
		
		Возврат Результат;
	КонецЕсли;	

	УстановитьПривилегированныйРежим(Истина);
	НачатьТранзакцию();
	
	Попытка
		ДатаПроверкиАХ = ТекущаяДата();
		ТекущаяЯчейка = Справочники.СкладскиеЯчейки.ПустаяСсылка();
		
		Для Каждого СтрокаТовара Из Товары Цикл 
			
			Если СтрокаТовара.Действие = Перечисления.ДействияПриПроверкеАдресногоХранения.ПрисвоитьТекущуюЯчейку Тогда
				ТекущаяЯчейка = ПолучитьЯчейкуНоменклатуры(Склад, СтрокаТовара.Номенклатура, Истина);
			КонецЕсли;
			
			НаборЗаписей = РегистрыСведений.СобытияПроверкиАдресногоХранения.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Период.Установить(ДатаПроверкиАХ);
			НаборЗаписей.Отбор.Склад.Установить(Склад);
			НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТовара.Номенклатура);
			Если СтрокаТовара.Действие = Перечисления.ДействияПриПроверкеАдресногоХранения.ПрисвоитьТекущуюЯчейку Тогда
				НаборЗаписей.Отбор.ИсходнаяЯчейка.Установить(ТекущаяЯчейка)
			Иначе
				НаборЗаписей.Отбор.ИсходнаяЯчейка.Установить(СтрокаТовара.ИсходнаяЯчейка); 
			КонецЕсли;
			НаборЗаписей.Отбор.ЦелеваяЯчейка.Установить(СтрокаТовара.ЦелеваяЯчейка);
						
			НоваяЗапись= НаборЗаписей.Добавить(); 
	      	НоваяЗапись.Период = ДатаПроверкиАХ; 
	   		НоваяЗапись.Номенклатура = СтрокаТовара.Номенклатура; 
			НоваяЗапись.Склад = Склад; 
			НоваяЗапись.Сотрудник = Сотрудник; 
			Если СтрокаТовара.Действие = Перечисления.ДействияПриПроверкеАдресногоХранения.ПрисвоитьТекущуюЯчейку Тогда
				НоваяЗапись.ИсходнаяЯчейка = ТекущаяЯчейка
			Иначе
				НоваяЗапись.ИсходнаяЯчейка = СтрокаТовара.ИсходнаяЯчейка; 
			КонецЕсли;
			НоваяЗапись.ЦелеваяЯчейка = СтрокаТовара.ЦелеваяЯчейка; 
			НоваяЗапись.Проверено = СтрокаТовара.Проверено; 
			НоваяЗапись.Действие = СтрокаТовара.Действие; 
			НоваяЗапись.НетЭтикетки = СтрокаТовара.НетЭтикетки; 
			НаборЗаписей.Записать();
			
			Если СтрокаТовара.Действие = Перечисления.ДействияПриПроверкеАдресногоХранения.ПереложитьВДругуюЯчейку Тогда
				НаборЗаписей = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Склад.Установить(Склад);				
				НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТовара.Номенклатура);
				НаборЗаписей.Отбор.Ячейка.Установить(Ячейка);				
				НаборЗаписей.Записать(); 
				
				МенеджерЗаписи = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Склад = Склад;
				МенеджерЗаписи.Ячейка = СтрокаТовара.ЦелеваяЯчейка;
				МенеджерЗаписи.Номенклатура = СтрокаТовара.Номенклатура;
				МенеджерЗаписи.ОсновнаяЯчейка = Истина;
				МенеджерЗаписи.Записать();	
				
			ИначеЕсли СтрокаТовара.Действие = Перечисления.ДействияПриПроверкеАдресногоХранения.СделатьЯчейкуДополнительной Тогда
				
				ДополнительнаяЯчейка = ПолучитьЯчейкуНоменклатуры(Склад, СтрокаТовара.Номенклатура, Ложь);
				Пока ДополнительнаяЯчейка <> Справочники.СкладскиеЯчейки.ПустаяСсылка() Цикл
					НаборЗаписей = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.Склад.Установить(Склад);				
					НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТовара.Номенклатура);
					НаборЗаписей.Отбор.Ячейка.Установить(ДополнительнаяЯчейка);				
					НаборЗаписей.Записать(); 
					ДополнительнаяЯчейка = ПолучитьЯчейкуНоменклатуры(Склад, СтрокаТовара.Номенклатура, Ложь);
				КонецЦикла;
				
				МенеджерЗаписи = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Склад = Склад;
				МенеджерЗаписи.Ячейка = СтрокаТовара.ЦелеваяЯчейка;
				МенеджерЗаписи.Номенклатура = СтрокаТовара.Номенклатура;
				МенеджерЗаписи.ОсновнаяЯчейка = Ложь;
				МенеджерЗаписи.Записать();				
				
			ИначеЕсли СтрокаТовара.Действие = Перечисления.ДействияПриПроверкеАдресногоХранения.ПрисвоитьТекущуюЯчейку Тогда
				НаборЗаписей = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Склад.Установить(Склад);				
				НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТовара.Номенклатура);
				НаборЗаписей.Отбор.Ячейка.Установить(ТекущаяЯчейка);				
				НаборЗаписей.Записать(); 
				
				МенеджерЗаписи = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Склад = Склад;
				МенеджерЗаписи.Ячейка = СтрокаТовара.ЦелеваяЯчейка;
				МенеджерЗаписи.Номенклатура = СтрокаТовара.Номенклатура;
				МенеджерЗаписи.ОсновнаяЯчейка = Истина;
				МенеджерЗаписи.Записать();				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
		ТекстСообщения = "Данные о хранении номенклатуры в ячейках записаны";
		Результат = Истина;
		
	Исключение
		ОтменитьТранзакцию();	
		
		ТекстСообщения = "Ошибка при записи в регистры: " + ИнформацияОбОшибке().Описание;
		Результат = Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
	
КонецФункции

 #КонецЕсли
